content/posts/fa.org
---
title: "How to heal The Fearful-Avoidant/Disorganized attachment style"
date: 2022-07-31T02:26:36+02:00
draft: false
---
/Hard choices, makes life easier, easy choices makes life harder/

First entry will be special and very personal, because the creation of this blog coincided with drastic changes in my life - the title explains it all - and therefore all other work will be suspended until this problem is resolved.

I didn't know it existed until June this year. Theoretically, there were articles on Wikipedia that he came across, but in the 2008 Polish edition, there was no mention of a disorganized style and I didn't know English at the time, so I lived in ignorance for the rest of my life. 

After a series of countless failures, confusion, mental disorders[fn:0][fn:1][fn:2][fn:3] finally i get rid of.

1. First of all, if you haven't done it yet (I didn't have to, as they didn't have much of an influence on me), forget everything you've seen in pop culture. It have as much to do with the truth as porn with real sex - lies or half-truth at best. Examples: [[https://www.youtube.com/watch?v=Imb09sotcmU][4 ways in which Hollywood messed up our views on love]]
2. Avoid redpill shit, because it's just like [[https://en.wikipedia.org/wiki/Horseshoe_theory][going from extreme to extreme]] and are especially harmful to FA as they fuel your core wound[fn:5]. For example in The Redpill handbook says:
   - Don't trust women. Lying and manipulating is to them what resolve and hard work are for us: our weapons in life.
   - Trust people (even women) to act in their own (perceived) self-interest at all times. You won't be disappointed. By WishIHadMyOldUsernam.
   - How do you trust anyone? Trust yourself, trust your judgement, don't take things personally and don't let others control you. By lonGterMgoalS.
   - Women simply. Are. Not. Loyal.
   - Etc. Confirmation bias is very strong here — they literally promote avoidant attachment. And it's a pseudoscience. Always use primary sources. Don't be fooled. And you guess what? Just because something can happen doesn't mean it will happen. So enjoy it, cherish it.
3. Instead, go to and learn correct attachment style. We are programmed for them by default. Tldr; 
4. If you feel stuck, don't worry. This is not speedrun, just a process. These books are so structured that you can be cured without consulting a psychotherapist. I was very determined to do this for two reasons: first is that in Poland [[https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Mental_health_and_related_issues_statistics][we have worst possible care of mental health (9.2 per 100 000 inhabitants) over the EU]]) second, because the core wound is trust issue, there may be a problem with trusting a psychotherapist.
5. The most annoying thing is probably not possible fully cured without finding someone with a secure style. A certain workaround to this problem is to absorb relevant patterns, good examples, which paulien talks about at the end of the video in the first link. 

* Recommended books
[fn:4]
** Dr. Diane Poole Heller - The Power of Attachment
"The Power of Attachment" is a book written by Dr. Diane Poole Heller. It provides an in-depth exploration of the concept of attachment and its impact on human development and relationships.

The book starts by discussing the importance of attachment in early childhood and how it shapes our emotional and social development throughout our lives. It also delves into different types of attachment styles, such as secure and insecure attachment, and how they can affect our relationships in adulthood.

One of the main themes of the book is how our attachment styles can impact our romantic relationships. The author explains how understanding our attachment style can help us identify patterns in our relationships and make changes to improve them.

The book also discusses the role of attachment in therapy and how it can be used as a tool for healing and growth. The author provides practical exercises and techniques that can be used to improve attachment and strengthen relationships.

In addition, the book covers the impact of trauma and attachment disorders on the brain and how they can affect behavior and relationships.

Overall, "The Power of Attachment" is a comprehensive and insightful guide to understanding the role of attachment in our lives and how it can be used to improve our relationships and overall well-being. It is a must-read for anyone interested in human psychology and relationships.

Please note that the book is written by a therapist and is intended to be read by professionals and laypeople alike, as well as for anyone who is interested in the topic.
** Dr. Sue Johnson - Love Sense - The Revolutionary New Science of Romantic Relationships
"Love Sense: The Revolutionary New Science of Romantic Relationships" is a book written by Dr. Sue Johnson, a clinical psychologist and researcher. The book focuses on the science of romantic relationships and how attachment theory can be used to improve them.

The book starts by discussing the importance of understanding the role of attachment in romantic relationships. The author explains how attachment theory, which is primarily associated with child-parent relationships, can also be applied to adult romantic relationships. She also explains how attachment styles can affect the way we interact with our partners, and how understanding these styles can help us improve our relationships.

One of the main themes of the book is the importance of emotional connection in romantic relationships. The author argues that emotional connection is crucial for the survival of romantic relationships and provides practical strategies for creating and maintaining emotional connection with our partners.

The book also covers the role of attachment in resolving conflicts and repairing relationships. The author explains how understanding attachment can help couples to understand their partner's perspective and improve communication.

The author also provides a detailed explanation of the Emotionally Focused Therapy (EFT) approach and how it can be used to improve attachment and strengthen relationships. The book concludes with the discussion of how to build a secure and lasting attachment with our partners.

Overall, "Love Sense" provides a new perspective on romantic relationships, by showing how attachment theory can be used to understand and improve them. The book is written in an accessible language and provides practical strategies and techniques that can be used to strengthen relationships. It is a valuable resource for anyone interested in understanding romantic relationships and how to improve them.
