posts/fa/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<title>How to heal The Fearful-Avoidant/Disorganized attachment style</title>
	
	
	<link rel="stylesheet" href="/css/style.css">
	
	
</head>
<body>
	<header>
	====================<br>
	== <a href="http://kompowiec.github.io/">kompowiec blog</a> ==<br>
	====================
	<div style="float: right;">freetard, libtard, zen</div><br>
	<p>
	<nav>
			<a href="/"><b>Start</b></a>.
			
			
			<a href="/posts/"><b>Posts</b></a>.
			
			<a href="/categories/"><b>Categories</b></a>.
			
			<a href="/tags/"><b>Tags</b></a>.
			
	</nav>
	</p>
	
</header>

	
	<main>
		<article>
			<h1>How to heal The Fearful-Avoidant/Disorganized attachment style</h1>
			<b><time>31.07.2022 02:26</time></b>
		       

			<div>
				
<p><em>Hard choices, makes life easier, easy choices makes life harder</em></p>
<p>
First entry will be special and very personal, because the creation of this blog coincided with drastic changes in my life - the title explains it all - and therefore all other work will be suspended until this problem is resolved.</p>
<p>
I didn&#39;t know it existed until June this year. Theoretically, there were articles on Wikipedia that he came across, but in the 2008 Polish edition, there was no mention of a disorganized style and I didn&#39;t know English at the time, so I lived in ignorance for the rest of my life. </p>
<p>
After a series of countless failures, confusion, mental disorders<sup class="footnote-reference"><a id="footnote-reference-1" href="#footnote-1">1</a></sup><sup class="footnote-reference"><a id="footnote-reference-2" href="#footnote-2">2</a></sup><sup class="footnote-reference"><a id="footnote-reference-3" href="#footnote-3">3</a></sup><sup class="footnote-reference"><a id="footnote-reference-4" href="#footnote-4">4</a></sup> finally i get rid of.</p>
<ol>
<li>
<p>First of all, if you haven&#39;t done it yet (I didn&#39;t have to, as they didn&#39;t have much of an influence on me), forget everything you&#39;ve seen in pop culture. It have as much to do with the truth as porn with real sex - lies or half-truth at best. Examples: <a href="https://www.youtube.com/watch?v=Imb09sotcmU">4 ways in which Hollywood messed up our views on love</a></p>
</li>
<li>
<p>Avoid redpill shit, because it&#39;s just like <a href="https://en.wikipedia.org/wiki/Horseshoe_theory">going from extreme to extreme</a> and are especially harmful to FA as they fuel your core wound<sup class="footnote-reference"><a id="footnote-reference-5" href="#footnote-5">5</a></sup>. For example in The Redpill handbook says:</p>
<ul>
<li>
<p>Don&#39;t trust women. Lying and manipulating is to them what resolve and hard work are for us: our weapons in life.</p>
</li>
<li>
<p>Trust people (even women) to act in their own (perceived) self-interest at all times. You won&#39;t be disappointed. By WishIHadMyOldUsernam.</p>
</li>
<li>
<p>How do you trust anyone? Trust yourself, trust your judgement, don&#39;t take things personally and don&#39;t let others control you. By lonGterMgoalS.</p>
</li>
<li>
<p>Women simply. Are. Not. Loyal.</p>
</li>
<li>
<p>Etc. Confirmation bias is very strong here — they literally promote avoidant attachment. And it&#39;s a pseudoscience. Always use primary sources. Don&#39;t be fooled. And you guess what? Just because something can happen doesn&#39;t mean it will happen. So enjoy it, cherish it.</p>
</li>
</ul>
</li>
<li>
<p>Instead, go to and learn correct attachment style. We are programmed for them by default. Tldr; </p>
</li>
<li>
<p>If you feel stuck, don&#39;t worry. This is not speedrun, just a process. These books are so structured that you can be cured without consulting a psychotherapist. I was very determined to do this for two reasons: first is that in Poland <a href="https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Mental_health_and_related_issues_statistics">we have worst possible care of mental health (9.2 per 100 000 inhabitants) over the EU</a>) second, because the core wound is trust issue, there may be a problem with trusting a psychotherapist.</p>
</li>
<li>
<p>The most annoying thing is probably not possible fully cured without finding someone with a secure style. A certain workaround to this problem is to absorb relevant patterns, good examples, which paulien talks about at the end of the video in the first link. </p>
</li>
</ol>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Recommended books
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Dr. Diane Poole Heller - The Power of Attachment
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>&#34;The Power of Attachment&#34; is a book written by Dr. Diane Poole Heller. It provides an in-depth exploration of the concept of attachment and its impact on human development and relationships.</p>
<p>
The book starts by discussing the importance of attachment in early childhood and how it shapes our emotional and social development throughout our lives. It also delves into different types of attachment styles, such as secure and insecure attachment, and how they can affect our relationships in adulthood.</p>
<p>
One of the main themes of the book is how our attachment styles can impact our romantic relationships. The author explains how understanding our attachment style can help us identify patterns in our relationships and make changes to improve them.</p>
<p>
The book also discusses the role of attachment in therapy and how it can be used as a tool for healing and growth. The author provides practical exercises and techniques that can be used to improve attachment and strengthen relationships.</p>
<p>
In addition, the book covers the impact of trauma and attachment disorders on the brain and how they can affect behavior and relationships.</p>
<p>
Overall, &#34;The Power of Attachment&#34; is a comprehensive and insightful guide to understanding the role of attachment in our lives and how it can be used to improve our relationships and overall well-being. It is a must-read for anyone interested in human psychology and relationships.</p>
<p>
Please note that the book is written by a therapist and is intended to be read by professionals and laypeople alike, as well as for anyone who is interested in the topic.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Dr. Sue Johnson - Love Sense - The Revolutionary New Science of Romantic Relationships
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>&#34;Love Sense: The Revolutionary New Science of Romantic Relationships&#34; is a book written by Dr. Sue Johnson, a clinical psychologist and researcher. The book focuses on the science of romantic relationships and how attachment theory can be used to improve them.</p>
<p>
The book starts by discussing the importance of understanding the role of attachment in romantic relationships. The author explains how attachment theory, which is primarily associated with child-parent relationships, can also be applied to adult romantic relationships. She also explains how attachment styles can affect the way we interact with our partners, and how understanding these styles can help us improve our relationships.</p>
<p>
One of the main themes of the book is the importance of emotional connection in romantic relationships. The author argues that emotional connection is crucial for the survival of romantic relationships and provides practical strategies for creating and maintaining emotional connection with our partners.</p>
<p>
The book also covers the role of attachment in resolving conflicts and repairing relationships. The author explains how understanding attachment can help couples to understand their partner&#39;s perspective and improve communication.</p>
<p>
The author also provides a detailed explanation of the Emotionally Focused Therapy (EFT) approach and how it can be used to improve attachment and strengthen relationships. The book concludes with the discussion of how to build a secure and lasting attachment with our partners.</p>
<p>
Overall, &#34;Love Sense&#34; provides a new perspective on romantic relationships, by showing how attachment theory can be used to understand and improve them. The book is written in an accessible language and provides practical strategies and techniques that can be used to strengthen relationships. It is a valuable resource for anyone interested in understanding romantic relationships and how to improve them.</p>
</div>
</div>
