posts/fa/index.html
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Dr. Marshall B. Rosenberg - Nonviolent Communication (A Language of Life)
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>&#34;Nonviolent Communication: A Language of Life&#34; is a book written by Dr. Marshall B. Rosenberg, a psychologist, and mediator. The book introduces the concept of Nonviolent Communication (NVC), a method of communication that emphasizes empathy, compassion, and understanding in order to improve relationships and resolve conflicts.</p>
<p>
The book starts by discussing the importance of effective communication in human relationships and how traditional forms of communication can often lead to misunderstandings, hurt feelings, and conflicts. The author explains how NVC can be used as an alternative to traditional forms of communication and how it can foster deeper understanding, connection, and compassion.</p>
<p>
One of the main themes of the book is the importance of empathy and understanding in communication. The author explains how NVC emphasizes listening to and understanding the feelings and needs of others in order to create deeper levels of understanding and connection. He also provides practical exercises and techniques for developing empathy and understanding in communication.</p>
<p>
The book also covers the role of NVC in resolving conflicts and improving relationships. The author explains how NVC can be used to identify and express needs, feelings, and requests in a way that is respectful and non-threatening, and how it can help to create solutions that meet the needs of all parties involved.</p>
<p>
The author also delves into the philosophical foundations of NVC and its connection to nonviolence and compassion. He explains how NVC can be used as a tool for personal growth and social change.</p>
<p>
Overall, &#34;Nonviolent Communication&#34; is a comprehensive and practical guide to understanding and using NVC to improve relationships and resolve conflicts. The book is written by the originator of the method, and is based on his extensive research and clinical experience. It is a valuable resource for anyone interested in understanding and using NVC in their personal and professional lives, including mental health professionals, educators, and anyone who wants to improve their communication skills.</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Dr. Robert Bolton - People Skills How to Assert Yourself, Listen to Others, and Resolve Conflicts
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>
&#34;People Skills: How to Assert Yourself, Listen to Others, and Resolve Conflicts&#34; is a book written by Dr. Robert Bolton, a therapist, and researcher. The book provides a comprehensive guide to understanding and developing people skills, which are the abilities that help us to interact effectively with others in personal and professional settings.</p>
<p>
The book starts by discussing the importance of people skills in building successful relationships and resolving conflicts. The author explains how people skills can help us to assert ourselves in a respectful and effective manner, to listen actively and empathetically to others, and to resolve conflicts in a way that is beneficial for all parties involved.</p>
<p>
One of the main themes of the book is the importance of effective communication in people skills. The author explains how effective communication is essential for building trust, understanding, and connection with others, and how it can be used to assert ourselves, listen to others, and resolve conflicts. He also provides practical exercises and techniques for developing effective communication skills.</p>
<p>
The book also covers the role of self-awareness in people skills. The author explains how self-awareness is essential for understanding our own thoughts, feelings, and behavior, and how it can be used to improve our interactions with others.</p>
<p>
The book also delves into the various types of conflicts and how to deal with them effectively. It covers assertiveness, active listening, empathy, problem-solving and negotiation, and how to apply these skills to various types of conflicts</p>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Pete Walker - Complex PTSD From Surviving to Thriving A Guide and Map for Recovering from Childhood Trauma Createspace
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>Pete Walker&#39;s &#34;Complex PTSD: From Surviving to Thriving&#34; is a comprehensive guide for those who have experienced childhood trauma and are looking to recover and heal. In the book, Walker provides a map for recovery that includes both theoretical and practical information.</p>
<p>
The author begins by discussing the concept of Complex Post-Traumatic Stress Disorder (C-PTSD) and how it differs from traditional PTSD. He explains that C-PTSD is a condition that arises from prolonged and repeated traumatic experiences, such as those that occur in childhood, and that it can have a profound impact on a person&#39;s mental and emotional well-being.</p>
<p>
Throughout the book, Walker delves into the various symptoms of C-PTSD, including emotional dysregulation, anxiety, depression, and shame. He also covers the impact of trauma on relationships and how it can lead to difficulties with trust, intimacy, and attachment.</p>
<p>
In addition to exploring the symptoms and effects of C-PTSD, Walker provides practical strategies for recovery, including mindfulness-based practices, cognitive-behavioral therapy, and psychodynamic approaches. He also highlights the importance of self-compassion and self-care in the recovery process, as well as the role that support from others can play.</p>
<p>
Ultimately, the author&#39;s goal is to help individuals who have experienced childhood trauma to understand their condition and to provide a roadmap for healing and recovery. Through a combination of in-depth information and practical strategies, &#34;Complex PTSD: From Surviving to Thriving&#34; offers hope and guidance to those looking to reclaim their lives after childhood trauma.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
Acknowledgements:
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<ul>
<li>
<p>wariatnakaftan — for forcing changes that I would never have dared otherwise. It just wouldn&#39;t be possible.</p>
</li>
<li>
<p>silent_girl — for support and wisdom.</p>
</li>
<li>
<p>hombre — for advices.</p>
</li>
</ul>
<p><em>Never underestimate the importance of people who are kind to you — Bear grylls, A Survival Guide for Life (25 chapter)</em></p>
</div>
</div>
<div id="outline-container-headline-14" class="outline-2">
<h2 id="headline-14">
See also
</h2>
<div id="outline-text-headline-14" class="outline-text-2">
<ul>
<li>
<p><a href="https://www.dropbox.com/s/mtr4l19les54g3g/THE%20BEST%20BOOKS%20TO%20HEAL%20ATTACHMENT%20TRAUMA.zip?dl=0">Download dacemars books</a></p>
<ul>
<li>
<p><a href="https://www.dropbox.com/s/v7q8lu4g3cif2nz/THE%20BEST%20BOOKS%20TO%20HEAL%20ATTACHMENT%20TRAUMA-audiobook.zip?dl=0">Audiobook version (Google TTS)</a></p>
</li>
</ul>
</li>
<li>
<p><a href="https://anonfiles.com/6eccK4h0za/Pete_Walker_Complex_PTSD_From_Surviving_to_Thriving_A_Guide_and_Map_for_Recovering_from_Childhood_Trauma_Createspace_2013_epub">Download Pete walker</a></p>
</li>
</ul>
</div>
</div>
